xml/request/getUser.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
xmlns:xml="http://www.w3.org/XML/1998/namespace"
xmlns:xs="http://www.w3.org/2001/XMLSchema"
xmlns:ousw="http://oss.dbc.dk/ns/openuserstatus_wsdl"
xmlns:ous="http://oss.dbc.dk/ns/openuserstatus"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
<SOAP-ENV:Body>
<ous:getUserRequest>
  <ous:agencyId>?</ous:agencyId>
  <ous:authentication>
    <ous:groupIdAut>?</ous:groupIdAut>
    <ous:passwordAut>?</ous:passwordAut>
    <ous:userIdAut>?</ous:userIdAut>
  </ous:authentication>
  <ous:callback>?</ous:callback>
  <ous:outputType>?</ous:outputType>
  <ous:userId>?</ous:userId>
  <ous:userPincode>?</ous:userPincode>
</ous:getUserRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
